-- DELETE FROM `tbl_product`;
-- DELETE FROM `tbl_category`;
-- DELETE FROM `tbl_sale`;

-- INSERT INTO `tbl_category` (id, name) VALUES
-- (1, '치킨'),
-- (2, '피자'),
-- (3, '떡볶이'),
-- (4, '중식'),
-- (5, '한식'),
-- (6, '보쌈/닭발'),
-- (7, '주류');
--
-- INSERT INTO `tbl_sale` (id, name, percentage, start_date, end_date) VALUES
-- (1, '설 맞이 반값 할인', 50, '2007-03-01 00:00:00', '2007-04-01 00:00:00'),
-- (2, '초특가 사장님 기분 좋아서 할인', 75, '2007-03-01 00:00:00', '2007-04-01 00:00:00'),
-- (3, '긴급 재고 처리 할인', 90, '2007-03-01 00:00:00', '2007-04-01 00:00:00');

    -- 직접 쿼리로 1,280만건 이상의 product 생성

-- INSERT INTO `tbl_product` (id, name, price, quantity, created_date, category_id, sale_id) VALUES
-- (1, '바삭 치킨', 10000, 10, '2007-03-01 00:00:00', 1, null),
-- (2, '짱커 피자', 15000, 8, '2007-03-01 00:00:00', 2, 1),
-- (3, '개매워 닭발', 12000, 15, '2007-03-01 00:00:00', 6, 2),
-- (4, '착착 짜장면', 8000, 20, '2007-03-01 00:00:00', 4, 1),
-- (5, '개큰얼큰 짬뽕', 9000, 20, '2007-03-01 00:00:00', 4, null);
